{"@context":"https://schema.org","@type":"JobPosting","title":"Software Developer - Junior Level","datePosted":"2025-09-10T15:36:41-05:00","hiringOrganization":{"@type":"Organization","name":"Zekiah Technologies, Inc","logo":"https://recruiting.paylocity.com/recruiting/jobs/GetLogoFile?moduleId=34021"},"description":"<p>Description</p><p>We are seeking a self-starting, creative Junior Software Developer to join our team in supporting our DoD client. The working environment requires an innovative-minded developer who can work closely with our client, identifying and developing advanced concept applications.</p><p><br/></p><p>As a Software Developer, you will design and develop application architectures to support the DoD client objectives. These applications will include various areas such as modeling and simulation, graph analysis and protocol development and analysis, large data integration, and Artificial Intelligence/Machine Learning. Other responsibilities include:</p><ul><li>Interface design and development experience</li><li>Applications may be developed solo and in team environments.</li><li>Capture and create software application requirements</li><li>Perform rapid application prototyping to evaluate concepts to be integrated into permanent frameworks</li><li>Design and develop scalable application frameworks</li><li>Familiar with Agile methodologies and principles</li></ul><p>Requirements</p><ul><li>2+ years of experience in object-oriented software development</li><li>Experience creating solutions to complex problems within a collaborative, cross-functional team</li><li>Knowledge of databases and Object-Relational Mapping (ORM) frameworks</li><li>Knowledge of programming languages, such as Java, Python, or C#</li><li>Knowledge of architecture styles for APIs, including REST or MVC</li><li>HS diploma or GED</li><li>Ability to obtain a DoD 8570 IAT II Certification, including Security+, within 30 days of start date&nbsp;</li></ul><p><strong>Nice If You Have:&nbsp;</strong></p><ul><li>2+ years of experience with database technologies, including SQL Server, PostgreSQL, or MongoDB</li><li>Experience with CI/CD tools, including GitLab</li><li>Experience with C#, .NET, and .NET Core, Web API, MVC, or LINQ</li><li>Experience with Scripting languages, including PowerShell or Python</li><li>Experience with JavaScript libraries and frameworks, including jQuery, d3, React, or Vue</li><li>Experience with Containers, including Docker or Kubernetes</li><li>Bachelor’s degree in computer science, engineering, or a related field&nbsp;</li></ul><p><strong>Contingent Work Eligibility Requirements</strong></p><ul><li>U.S. citizen and able to obtain/maintain a TS-SCI security clearance</li></ul><p><strong>Clearance Level - Final Position Requirement</strong></p><ul><li>Active TS-SCI&nbsp;</li></ul><p>Travel Required: No</p><p>Potential for Telework: No</p><p><br/></p><p><strong>About Us</strong></p><p>Here at Zekiah, our journey is about enhancing our warfighters’ superiority by developing and integrating forward-thinking communication and technology systems. Each team member plays an important role in making this possible by bringing their skills and knowledge to help our customers tackle their challenges, devise innovative solutions, and support their critical missions. We take care of our employees through a balanced work life, fair salaries, great benefits, and giving them a voice.&nbsp;</p><p>&nbsp;&nbsp;</p><p><strong>Benefits</strong></p><p>We offer health, dental, vision, life, and supplemental insurance for full-time employees and their families. We also offer holiday and vacation pay, sick leave, performance-based bonuses, a retirement plan with company match, and an education reimbursement program. Explore our benefits and work culture at https://www.zekiah.com/careers.&nbsp;</p><p><br/></p><p><strong>Equal Employment Opportunity Policy</strong></p><p>Zekiah Technologies, Inc. does not discriminate based on race, color, religion, sex (including pregnancy and gender identity), ethnicity, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, parental status, military service, or other non-merit factor.</p>","jobLocation":{"@type":"Place","address":{"@type":"PostalAddress","streetAddress":"17320 Dahlgren Road","addressLocality":"Dahlgren","addressRegion":"VA","postalCode":"22448-5119","addressCountry":"US"}}}
  